Notebook to write Lat Lon in Text files to be used by hysplit later

In [1]:
import numpy as np
import pandas as pd
from netcdftime import utime
from datetime import datetime

In [2]:
#checking JDD
cdftime = utime('days since 1997-01-00 00:00:00') #defined wrt SHEBA wrt to days and not hours
#date = datetime.now()
#print (date)
#type(date)
t3 = 1 #jan 1,1997 is JD1 for Sheba
date3 = cdftime.num2date(t3)
print (date3)

1997-01-01 00:00:00

In [3]:
df = pd.read_csv("/work/ollie/muali/data/ASFG_tower/prof_file_davg_all6_ed.txt", header=None, delim_whitespace=True)

In [4]:
dates = list (df [0])
date_indx = cdftime.num2date(dates) #converting JDD to Gregorian calendar dates

In [5]:
d = np.array([df[1], df[2], df[3]])
d_t = np.transpose(d) #To convert it to 338x3 rows

df2 = pd.DataFrame(data=d_t, index=date_indx, columns=['Lat', 'Lon', 'Pressue']) 
#creating a dataframe for quick analysis

In [6]:
df2.mean()

Lat        1133.646136
Lon         922.487830
Pressue    1521.301479
dtype: float64

In [7]:
len(df2)

338

In [8]:
df2 = df2.replace(9999.0, np.nan)
df2.head()

                          Lat        Lon  Pressue
1997-10-29 12:00:00  75.62661 -144.02284   1006.1
1997-10-30 12:00:00  75.70988 -144.26531    990.7
1997-10-31 12:00:00  75.71852 -144.15818    993.8
1997-11-01 12:00:00  75.75302 -143.94832   1012.8
1997-11-02 12:00:00  75.83746 -143.97228   1021.5

In [9]:
df2[['Lat', 'Lon']].fillna(method='ffill')
df2.head()

                          Lat        Lon  Pressue
1997-10-29 12:00:00  75.62661 -144.02284   1006.1
1997-10-30 12:00:00  75.70988 -144.26531    990.7
1997-10-31 12:00:00  75.71852 -144.15818    993.8
1997-11-01 12:00:00  75.75302 -143.94832   1012.8
1997-11-02 12:00:00  75.83746 -143.97228   1021.5

In [10]:
# Quality check
#df3 = df2.loc[df2['Lat'] < 999]
len(df2)

338

In [8]:
df3[df3.Pressue==1012].Lat.mean()

76.12738

In [9]:
df3.head()

                          Lat        Lon  Pressue
1997-10-29 12:00:00  75.62661 -144.02284   1006.1
1997-10-30 12:00:00  75.70988 -144.26531    990.7
1997-10-31 12:00:00  75.71852 -144.15818    993.8
1997-11-01 12:00:00  75.75302 -143.94832   1012.8
1997-11-02 12:00:00  75.83746 -143.97228   1021.5

In [15]:
mask = np.array (df2['Lat']) < 999 #mask has to be made as np array to extract dateobjects
t = date_indx[mask] #if mask is series or list, it doesn't work
len(t) #length to check

302

In [25]:
#df3_reverse = df2.loc[df2['Lat'] == 999.0]
mask_reverse = []
for lat in df2['Lat']:
    if lat > 100.0:
        mask_reverse.append(True)
    else:
        mask_reverse.append(False)

df2 [mask_reverse]

                        Lat     Lon  Pressue
1997-11-19 12:00:00  9999.0  9999.0   1020.3
1997-12-01 12:00:00  9999.0  9999.0   1014.6
1998-01-01 12:00:00  9999.0  9999.0   1037.1
1998-01-02 12:00:00  9999.0  9999.0   1029.6
1998-01-20 12:00:00  9999.0  9999.0   1042.2
1998-01-21 12:00:00  9999.0  9999.0   1042.0
1998-01-22 12:00:00  9999.0  9999.0   1039.4
1998-01-23 12:00:00  9999.0  9999.0   1035.1
1998-01-26 12:00:00  9999.0  9999.0   1010.0
1998-01-30 12:00:00  9999.0  9999.0   1006.6
1998-01-31 12:00:00  9999.0  9999.0   1011.3
1998-02-01 12:00:00  9999.0  9999.0   1010.4
1998-02-02 12:00:00  9999.0  9999.0   1018.4
1998-02-03 12:00:00  9999.0  9999.0   1027.7
1998-02-04 12:00:00  9999.0  9999.0   1028.2
1998-02-05 12:00:00  9999.0  9999.0   1018.3
1998-02-06 12:00:00  9999.0  9999.0   1014.8
1998-02-10 12:00:00  9999.0  9999.0   1025.7
1998-02-27 12:00:00  9999.0  9999.0   1011.2
1998-02-28 12:00:00  9999.0  9999.0   1018.2
1998-03-01 12:00:00  9999.0  9999.0   1030.9
1998-03-07 12:00:00  9999.0  9999.0   1027.6
1998-03-08 12:00:00  9999.0  9999.0   1017.6
1998-03-18 12:00:00  9999.0  9999.0   1020.8
1998-03-19 12:00:00  9999.0  9999.0   1018.9
1998-03-21 12:00:00  9999.0  9999.0   1015.3
1998-03-22 12:00:00  9999.0  9999.0   1004.6
1998-03-23 12:00:00  9999.0  9999.0   1009.5
1998-03-24 12:00:00  9999.0  9999.0   1008.2
1998-03-25 12:00:00  9999.0  9999.0   1014.7
1998-03-26 12:00:00  9999.0  9999.0   1016.3
1998-04-13 12:00:00  9999.0  9999.0   1013.0
1998-06-05 12:00:00  9999.0  9999.0   9999.0
1998-07-13 12:00:00  9999.0  9999.0   1025.4
1998-08-24 12:00:00  9999.0  9999.0   1011.0
1998-08-25 12:00:00  9999.0  9999.0   1014.2

In [20]:
df3_reverse

Empty DataFrame
Columns: [Lat, Lon, Pressue]
Index: []

In [13]:
#Extracting Lat, Lon to write it in the file inside a loop
Lat = np.array([df3['Lat']])
Lon = np.array([df3['Lon']])
Sfc_Pressure = np.array(['Pressure'])

In [27]:
date_str_test = '{:%d %m}'.format(t[84+19])
date_str_test #31 for Nov 30

'02 03'

In [10]:
cd /work/ollie/muali/data/back_traj/ASFG_tower

/work/ollie/muali/data/back_traj/ASFG_tower

In [11]:
mkdir Feb

In [12]:
cd /work/ollie/muali/data/back_traj/ASFG_tower/Feb/

/work/ollie/muali/data/back_traj/ASFG_tower/Feb

In [28]:
f1 = open('Lon.txt','w')
f2 = open('Lat.txt', 'w')
f3 = open('days.txt', 'w')
date_str = []
counter = 0 #Counter tells the missing dates 
            #Also used to write date_str
            # In range stop is not included
for i in range(84,103):
    f1.write(str(Lon[0, i]))
    f1.write(" ")
    f2.write(str(Lat[0, i]))
    f2.write(" ")
    date_str.append('{:%d}'.format(t[i]))
    #f3.write("This file contains days of observation\n")
    f3.write(date_str[counter])
    f3.write(" ")
    counter = counter + 1
f1.close()
f3.close()
f2.close()
counter

19

In [17]:
(Lat[0,1])

75.709879999999998

In [36]:
b = range(32, 61)
print(b)

range(32, 61)